#pragma once
#ifndef WARP_URDAN_H
#define WARP_URDAN_H

#include "Go_Loadout.h"

class Go {
private:
	SDL_Window* sdl_window{ nullptr };
	SDL_Renderer* sdl_renderer{ nullptr };
	SDL_Texture* sdl_texture{ nullptr };

	Devise devise;
	UI ui;
	Style style;
public:
	// |<{<[<(< \/ >)>]>}>|
	// System

	SDL_AppResult System_Init_SDL();
	void System_Init_ImGui();

	void System_Render_Start();
	void System_Render_ImGui_End();
	void System_Render_SDL_End();

	void System_Quit_ImGui();
	void System_Quit_SDL();

	// |<{<[<(< \/ >)>]>}>|
	//UI
	void UI_Add_Widjet(Widjet_Type type, Int2 pos, Int2 size);

	void UI_Clear_SWindow();

	void UI_Draw_Main();

	// |<{<[<(< \/ >)>]>}>|
	// Events
	void Events_processing(SDL_Event* event);
	void Events_Mous_Press(SDL_Event* event);
	void Events_Mous_Motion(SDL_Event* event);
	SDL_AppResult Events_Keyboard_Press(SDL_Event* event);
};

#endif // WARP_URDAN_H

/*
Futur goals :
[КЛАСИ ТА СТРУКТУРИ]
> Функції в UI для оновлення стилю, зміни його данних.
> Mous - Зберігає данні для роботи с мишкою public: pos_cur, pos_prev, mode_grab.
> Перезібрати Engine в Event, бо сама програма уже і є рушієм.Обробля події, тобто ввод з клавіатури та миши.

[ВІКНА]
> В залежності від розміра головного вікна змінюється і розмір SDL вікна.
> Вікно повинно мати розмітку з клітинок розміром 32х32 пікселя.
> Розмір вікна підганняється під розмітку.
> Клітинки повинні мати рамку та внутрішній ромб, який повине бути прозоріше чім рамка.
> Коли курсор знаходиться над клітинкой то вона замінюється клітинку іншого кольору, і так же принатисканні.
> При натискані лкм на клітинку вилазе віконце с вибором типу віджета.
> При натискані пкм відкривається загальне меню для вибора вікон, які модна вмикати та вимикати.

[ВІДЖЕТИ]
> Розмір віджета вимірюється в клітинках.
> В залежності від розміру віджета має різний обьєм функціоналу.

> Набір віджетів Колір, Холст, Палітра, Інструменти, Слої, Інформація.
Колір - два квадрати під олівець і гумку, стандартний вибір кольора ImGui, 4 повзунка
Холст - нічого особливого простий без рамок.
Палітра просто набір квадратиків с змінними кольорами.
Інструменти - Просто зборище кнопок.
Слої - Скролер зі пронумерованими слоями.
Інформація - FPS, MSPF, System time, Mous x and y,

> Можливість розтягувати поклітинно, з впиранням в інші віджети.
> Можливість переміщяти поклітинно, покласти сверху на інший віджет неможливо, тоді відміняється перетягування.
> Взаємодія через пкм покищо тільки закриття.

[ЛЯЧНО]
> Однакові пікселі що ідуть підряд в холсті повинні зжиматися в один.
> Сверх масив - зберігає всі пікселі замість холстів і тільки ті що існують, молнієносна ітерасія через 0 пікселі
> Історія  дій користувача для ctrl-z та ctrl-shift-z
> Звукові ефекти

[ІНСТРУМЕНТИ]:
Олівець - малює пікселі заданого кольору.
Гумка - той же олівець, просто протирає диру в коді до потрібного кольору.
Область - виділяє та обмежує область(повинен з'являтися контур) в якій можна працювати, після виділення можна просто перетягнути область, LMB виділяє квадрат, RMB виділяє по пікселю. Shift дозволяє добавляти область до уже існуючої
Градієнт - створю градієнт в виділеній області
Спрей - рисує пікселі в випадкових місцях біля курсора
Фігури - лінія, квадрат, круг я хз як робити круг.
Коли вибираєш інструмент випадають його налаштування.
На полотні за мишкою слідує курсор, має дві форми круг, квадрат.
*/